OpenFOAM-v2112/tutorials/multiphase/overInterDyMFoam/rigidBodyHull/background/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00521;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(atmosphere|outlet)"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "(HULL*.*)"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "(BLADES|HUB_DISK|HUB)"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "(overset-1|oversetPatch)"
    {
        type           overset;
    }
}


// ************************************************************************* //
